# Table of Contents
 <p><div class="lev1"><a href="#Import-pandas,-numpy,-matplotlib-and-seaborn"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas, numpy, matplotlib and seaborn</a></div><div class="lev1"><a href="#Create-a-Series-object,-access-it's-index-and-cells"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create a Series object, access it's index and cells</a></div><div class="lev1"><a href="#Create-a-DataFrame-object,-access-its-rows,-columns,-indices,-cells"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create a DataFrame object, access its rows, columns, indices, cells</a></div><div class="lev1"><a href="#Data-Import"><span class="toc-item-num">4&nbsp;&nbsp;</span>Data Import</a></div><div class="lev1"><a href="#DataFrame-filtering"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFrame filtering</a></div><div class="lev1"><a href="#Data-export"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data export</a></div><div class="lev1"><a href="#DataFrame-aggregation"><span class="toc-item-num">7&nbsp;&nbsp;</span>DataFrame aggregation</a></div><div class="lev1"><a href="#Data-Merging"><span class="toc-item-num">8&nbsp;&nbsp;</span>Data Merging</a></div>

This notebook is to quickly repeat the most basic pandas operations prior to starting the practical course.
You should be able to quickly perform the following tasks before you start working on the exercises in the Day1 notebook. If you need to look up, how certain problems can be solved, have a look at the pandas [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), the [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) and the lecture slides.

# Import pandas, numpy, matplotlib and seaborn

In [2]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

ImportError: No module named seaborn

# Create a Series object, access it's index and cells

Create a Series object representing the following measurements

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

In [3]:
s = pd.Series([1.0, 1.5, 3.0, 4.3, 8.2])

In [4]:
s

0    1.0
1    1.5
2    3.0
3    4.3
4    8.2
dtype: float64

# Create a DataFrame object, access its rows, columns, indices, cells

Create a dataframe of the following table.

|index   |a |b  |c   |d          |e |
|--------|--|---|----|-----------|--|
|1       |2 |3  |5.  |horse      |13|
|2       |3 |1  |1.4 |cat        |11|
|3       |4 |9  |1.2 |dog        |  |
|4       |5 |12 |0.8 |tortoise   |  |
|5       |6 |2  |2.3 |rabbit     |9 |

Now
* access the values of each row individually
* access single cells
* print the index and column names
* access values of each column individually
* rename columns
* extract rows 2-4 as new dataframe
* obtain summary table of dataframe

In [24]:
df = pd.DataFrame([[1,2,3,5.,"horse",13],
                   [2,3,1,1.4,"cat",11],
                   [3,4,9,1.2,"dog",""],
                   [4,5,12,0.8,"tortoise",""],
                   [5,6,2,2.3,"rabbit",9]],
                  columns=["index",'a','b','c','d','e'])
df

   index  a   b    c         d   e
0      1  2   3  5.0     horse  13
1      2  3   1  1.4       cat  11
2      3  4   9  1.2       dog
3      4  5  12  0.8  tortoise
4      5  6   2  2.3    rabbit   9

In [45]:
df.values[1,]

          index         a          x         c
count  5.000000  5.000000   5.000000  5.000000
mean   3.000000  4.000000   5.400000  2.140000
std    1.581139  1.581139   4.827007  1.690562
min    1.000000  2.000000   1.000000  0.800000
25%    2.000000  3.000000   2.000000  1.200000
50%    3.000000  4.000000   3.000000  1.400000
75%    4.000000  5.000000   9.000000  2.300000
max    5.000000  6.000000  12.000000  5.000000

In [51]:
df.values[1,1]

3L

In [52]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [105]:
df.columns

Index([u'index', u'a', u'x', u'c', u'd', u'e'], dtype='object')

In [118]:
df.values[:,1]

array([2L, 3L, 4L, 5L, 6L], dtype=object)

In [54]:
df.rename(columns={'b': 'x'})

   index  a   x    c         d   e
0      1  2   3  5.0     horse  13
1      2  3   1  1.4       cat  11
2      3  4   9  1.2       dog
3      4  5  12  0.8  tortoise
4      5  6   2  2.3    rabbit   9

In [56]:
new_df = pd.DataFrame(df.values[2:4,])
new_df

   0  1   2    3         4 5
0  3  4   9  1.2       dog
1  4  5  12  0.8  tortoise

In [57]:
df.describe()

          index         a          x         c
count  5.000000  5.000000   5.000000  5.000000
mean   3.000000  4.000000   5.400000  2.140000
std    1.581139  1.581139   4.827007  1.690562
min    1.000000  2.000000   1.000000  0.800000
25%    2.000000  3.000000   2.000000  1.200000
50%    3.000000  4.000000   3.000000  1.400000
75%    4.000000  5.000000   9.000000  2.300000
max    5.000000  6.000000  12.000000  5.000000

# Data Import

Import the following file into a dataframe _df2_:

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D

In [63]:
df2 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D")
df2

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

Now import the following file into a pandas dataframe _df3_. Do you need to change some parameters of the funtion?
Check whether import makes sense by showing the dataframe

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D

In [64]:
df3 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D")
df3

            a;b;c;d;e
0  2;3;5.0;horse;13.0
1    3;1;1.4;cat;11.0
2        4;9;1.2;dog;
3  5;12;0.8;tortoise;
4  6;2;2.3;rabbit;9.0

In [65]:
df4 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D",sep=';')
df4

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

# DataFrame filtering
Using the dataframe created in section 3:

* select rows containing values greater than 2 in the 3rd column
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

In [76]:
df2[df2["c"] > 2]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
4  6  2  2.3  rabbit   9.0

In [92]:
df2[(df2["c"] > 2) | (df2["d"] == "cat")]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [101]:
df4.dropna(how='any')

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [103]:
df4.drop_duplicates()

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [108]:
df4.loc[1:,]

   a   b    c         d     e
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [ ]:
df4.sort_values

In [135]:
df4.sort_values(by = 'b')

   a   b    c         d     e
1  3   1  1.4       cat  11.0
4  6   2  2.3    rabbit   9.0
0  2   3  5.0     horse  13.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN

In [154]:
df4['d'].str.title()

0       Horse
1         Cat
2         Dog
3    Tortoise
4      Rabbit
Name: d, dtype: object

# Data export

Export your filtered dataframe as a text file separated by tabs omitting the index column.

In [157]:
df4.to_csv(r'pandas.txt', sep='\t', mode='a')

# DataFrame aggregation

Using _df4_, group the data by column 'b'. Test different ways of aggregating the remaining columns as shown in the lecture.

In [158]:
df4

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [165]:
grouped = df4.groupby('b')
grouped.groups

{1: [1L], 2: [4L], 3: [0L], 9: [2L], 12: [3L]}

In [163]:
grouped.agg(np.mean)

    a    c     e
b
1   3  1.4  11.0
2   6  2.3   9.0
3   2  5.0  13.0
9   4  1.2   NaN
12  5  0.8   NaN

In [166]:
grouped.agg({'a': {'mean': np.mean, 'max': np.max},
             'b': {'mean': np.mean, 'max': np.max}})

     a        b
   max mean max mean
b
1    3    3   1    1
2    6    6   2    2
3    2    2   3    3
9    4    4   9    9
12   5    5  12   12

# Data Merging

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

In [179]:
df5 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/Integrated_Bioinformatics/master/example_data/df4.csv")
df5

         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN

In [180]:
df6 = df2.merge(df5, on=['c','d','e'])
df6

   a  b_x    c      d     e     b_y
0  2    3  5.0  horse  13.0  mammal
1  3    1  1.4    cat  11.0  mammal
2  4    9  1.2    dog   NaN  mammal

In [189]:
df6.columns=['Price','Speed','Jumpheight','Species','Weight','Class']
df6

   Price  Speed  Jumpheight Species  Weight   Class
0      2      3         5.0   horse    13.0  mammal
1      3      1         1.4     cat    11.0  mammal
2      4      9         1.2     dog     NaN  mammal

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.

In [192]:
pd.concat([df5,df2],axis=0)

     a        b    c         d     e
0  NaN   mammal  5.0     horse  13.0
1  NaN   mammal  1.4       cat  11.0
2  NaN   mammal  1.2       dog   NaN
3  NaN     fish  0.1  goldfish   NaN
4  NaN  reptile  2.3     snake   9.0
5  NaN     fish  1.8       koi  10.0
6  NaN     fish  0.8      carp   NaN
0  2.0        3  5.0     horse  13.0
1  3.0        1  1.4       cat  11.0
2  4.0        9  1.2       dog   NaN
3  5.0       12  0.8  tortoise   NaN
4  6.0        2  2.3    rabbit   9.0

In [201]:
df2.merge(df5,on=['b','c','d'],how= 'outer')

      a        b    c         d   e_x   e_y
0   2.0        3  5.0     horse  13.0   NaN
1   3.0        1  1.4       cat  11.0   NaN
2   4.0        9  1.2       dog   NaN   NaN
3   5.0       12  0.8  tortoise   NaN   NaN
4   6.0        2  2.3    rabbit   9.0   NaN
5   NaN   mammal  5.0     horse   NaN  13.0
6   NaN   mammal  1.4       cat   NaN  11.0
7   NaN   mammal  1.2       dog   NaN   NaN
8   NaN     fish  0.1  goldfish   NaN   NaN
9   NaN  reptile  2.3     snake   NaN   9.0
10  NaN     fish  1.8       koi   NaN  10.0
11  NaN     fish  0.8      carp   NaN   NaN

In [198]:
df2

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [199]:
df5

         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN